# Pandas Tutorial

In [2]:
import pandas as pd

In [226]:
#check pandas version
print(pd.__version__)

0.25.1

In [9]:
# Series is a one-dimensional labeled array capable of holding data of any type
myseries1 = pd.Series(lst)    
myseries1

0    10
1    20
2    30
3    40
dtype: int64

In [10]:
myseries1[0]

10

In [11]:
#We can create label 
labels = ['a','b','c','d']

In [13]:
#creating series with labels
myseries2 = pd.Series(data = lst, index = labels)
myseries2

a    10
b    20
c    30
d    40
dtype: int64

In [15]:
#We access data using labels also
myseries2['c']

30

In [26]:
#Adding 2 series's
ser1 = pd.Series(['West ','New ','Sri '])

In [27]:
ser2 = pd.Series(['Indies','York','Lanka'])

In [28]:
ser3 = ser1+ser2
ser3

0    West Indies
1       New York
2      Sri Lanka
dtype: object

In [29]:
#Mostly we donot use this series in data mining, because mostly data comes in different rows and columns ie in the form 
#excel or csv
#Example predicting the price of a used car - It contains many parmeters, like car mf, color, type,fuel,braking system etc
#these all data we get in form of excel or csv that is going to be a dataframe object

In [30]:
#DataFrame is a 2-dimensional labeled data structure with columns of potentially different types

In [31]:
#DataFrame is a function of pandas module which helps in creatint a dataframe

In [32]:
#index column   col1    col2    col3     col4

In [33]:
#The first column is considered as label or index

In [34]:
#let us try to create a dataframe of 5 rows and 5 columns using DataFrame() function

In [35]:
lst = [[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15],[16,17,18,19,20]]

In [36]:
lst

[[1, 2, 3, 4, 5], [6, 7, 8, 9, 10], [11, 12, 13, 14, 15], [16, 17, 18, 19, 20]]

In [37]:
mydataframe = pd.DataFrame(lst)

In [38]:
mydataframe

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20

In [41]:
mydataframe1 = pd.DataFrame(lst,columns = ["aa","bb","cc","dd","ee"], index=['row1','row2','row3','row4'])

In [42]:
mydataframe1

      aa  bb  cc  dd  ee
row1   1   2   3   4   5
row2   6   7   8   9  10
row3  11  12  13  14  15
row4  16  17  18  19  20

In [52]:
#creating a dataframe using numpy array
import numpy as np
arr1 = np.arange(16).reshape(4,4)

In [53]:
arr1

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [54]:
mydataframe2 = pd.DataFrame(arr1,columns = "col1 col2 col3 col4".split(), index = 'row1 row2 row3 row4'.split())
mydataframe2

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15

In [55]:
#I am using .split() because if i split() a string it will convert into a list only
"col1 col2 col3 col4".split()

['col1', 'col2', 'col3', 'col4']

creating a dataframe with random int function of size 5,5
give column names as subject marks
give row names as student names

In [59]:
arr2= np.random.randint(100, size = (5,5))

In [60]:
arr2

array([[ 8, 27, 70, 60, 36],
       [67, 83, 64, 46, 14],
       [63, 49, 24, 84,  3],
       [96,  8, 26, 19,  2],
       [33, 65, 90, 83, 79]])

In [67]:
mydataframe3 = pd.DataFrame(arr2,columns = " Sub1 Sub2 Sub3 Sub4 Sub5 ".split(), index = 'Stud1 Stud2 Stud3 Stud4 Stud5'.split())
mydataframe3

       Sub1  Sub2  Sub3  Sub4  Sub5
Stud1     8    27    70    60    36
Stud2    67    83    64    46    14
Stud3    63    49    24    84     3
Stud4    96     8    26    19     2
Stud5    33    65    90    83    79

# Indexing of Data Frames

In [68]:
data = mydataframe3
data

       Sub1  Sub2  Sub3  Sub4  Sub5
Stud1     8    27    70    60    36
Stud2    67    83    64    46    14
Stud3    63    49    24    84     3
Stud4    96     8    26    19     2
Stud5    33    65    90    83    79

In [70]:
#To display entire first column
data['Sub1']

Stud1     8
Stud2    67
Stud3    63
Stud4    96
Stud5    33
Name: Sub1, dtype: int32

In [72]:
#To display rows
#data['Stud1'] - It will index error

In [73]:
data.loc['Stud1']
#This gives in vertical fashion

Sub1     8
Sub2    27
Sub3    70
Sub4    60
Sub5    36
Name: Stud1, dtype: int32

In [80]:
data.iloc[0] # 0th index location - brings in full 1st row

Sub1    33
Sub2    65
Sub3    90
Sub4    83
Sub5    79
Name: Stud5, dtype: int32

In [81]:
data.iloc[1] # 1st index location - brings in full 2nd row

Sub1    67
Sub2    83
Sub3    64
Sub4    46
Sub5    14
Name: Stud2, dtype: int32

In [82]:
data.iloc[2] # 2nd index location - brings in full 3rd row

Sub1    63
Sub2    49
Sub3    24
Sub4    84
Sub5     3
Name: Stud3, dtype: int32

In [83]:
data.iloc[3] # 3rd index location - brings in full 4th row

Sub1    96
Sub2     8
Sub3    26
Sub4    19
Sub5     2
Name: Stud4, dtype: int32

In [84]:
data.iloc[4] # 4th index location - brings in full 5th row

Sub1    33
Sub2    65
Sub3    90
Sub4    83
Sub5    79
Name: Stud5, dtype: int32

In [86]:
#to read multiple rows
data.iloc[1:3]      # It brings in row index 1(start index is inclusive) and row index 2 ( end index is exclusive)

       Sub1  Sub2  Sub3  Sub4  Sub5
Stud2    67    83    64    46    14
Stud3    63    49    24    84     3

In [88]:
s = "Python"
s[1:3]    # s[start index : end+1 index]

'yt'

In [90]:
#alternate rows
data.iloc[::2]

       Sub1  Sub2  Sub3  Sub4  Sub5
Stud1     8    27    70    60    36
Stud3    63    49    24    84     3
Stud5    33    65    90    83    79

In [97]:
#To read some specific rows and some specific columns
#I want to see stud4, stud5 and  sub4,sub5
data.iloc[3:, 3:]

       Sub4  Sub5
Stud4    19     2
Stud5    83    79

In [98]:
#I want to see stud3,4,5 and sub 3,4,5
data.iloc[2:, 2:]

       Sub3  Sub4  Sub5
Stud3    24    84     3
Stud4    26    19     2
Stud5    90    83    79

In [99]:
#I want to see stud3,4 and sub 3,4,5
data.iloc[2:4, 2:]

       Sub3  Sub4  Sub5
Stud3    24    84     3
Stud4    26    19     2

In [100]:
#If I want to display only sub5 of all students
data.iloc[:,4]

Stud1    36
Stud2    14
Stud3     3
Stud4     2
Stud5    79
Name: Sub5, dtype: int32

In [103]:
#Reverse indexing
data.iloc[:,-1]

Stud1    36
Stud2    14
Stud3     3
Stud4     2
Stud5    79
Name: Sub5, dtype: int32

# Important Functions of Pandas module

In [104]:
df = pd.DataFrame(np.random.randint(20,30,16).reshape(4,4),'rr1 rr2 rr3 rr4'.split(), 'cc1 cc2 cc3 cc4'.split())

In [105]:
df

     cc1  cc2  cc3  cc4
rr1   21   21   27   20
rr2   25   28   26   21
rr3   25   20   26   29
rr4   21   21   20   27

In [110]:
#head() - It gives first 5 rows
df.head()

     cc1  cc2  cc3  cc4
rr1   21   21   27   20
rr2   25   28   26   21
rr3   25   20   26   29
rr4   21   21   20   27

In [111]:
#first 2 rows
df.head(2)

     cc1  cc2  cc3  cc4
rr1   21   21   27   20
rr2   25   28   26   21

In [112]:
#first 3 rows
df.head(3)

     cc1  cc2  cc3  cc4
rr1   21   21   27   20
rr2   25   28   26   21
rr3   25   20   26   29

In [113]:
#tail - will give last 5 rows
df.tail()

     cc1  cc2  cc3  cc4
rr1   21   21   27   20
rr2   25   28   26   21
rr3   25   20   26   29
rr4   21   21   20   27

In [115]:
#last 2 rows
df.tail(2)

     cc1  cc2  cc3  cc4
rr3   25   20   26   29
rr4   21   21   20   27

In [116]:
#last 3 rows
df.tail(3)

     cc1  cc2  cc3  cc4
rr2   25   28   26   21
rr3   25   20   26   29
rr4   21   21   20   27

In [117]:
#info() - datatype of each column will give
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, rr1 to rr4
Data columns (total 4 columns):
cc1    4 non-null int32
cc2    4 non-null int32
cc3    4 non-null int32
cc4    4 non-null int32
dtypes: int32(4)
memory usage: 96.0+ bytes

In [119]:
#describe() - all statistical information related to dataset
df.describe()

             cc1        cc2        cc3        cc4
count   4.000000   4.000000   4.000000   4.000000
mean   23.000000  22.500000  24.750000  24.250000
std     2.309401   3.696846   3.201562   4.425306
min    21.000000  20.000000  20.000000  20.000000
25%    21.000000  20.750000  24.500000  20.750000
50%    23.000000  21.000000  26.000000  24.000000
75%    25.000000  22.750000  26.250000  27.500000
max    25.000000  28.000000  27.000000  29.000000

In [139]:
df

     cc1  cc2  cc3  cc4
rr1   21   21   27   20
rr2   25   28   26   21
rr3   25   20   26   29
rr4   21   21   20   27

In [163]:
#adding a new column to dataframe
x = "aa bb cc dd".split()

In [164]:
df['newcolumn'] = x

In [165]:
df

     cc1  cc2  cc3  cc4 newcolumn
rr1   21   21   27   20        aa
rr2   25   28   26   21        bb
rr3   25   20   26   29        cc
rr4   21   21   20   27        dd

In [166]:
#set_index() - It will set one specified column as index
df.set_index('newcolumn')

           cc1  cc2  cc3  cc4
newcolumn
aa          21   21   27   20
bb          25   28   26   21
cc          25   20   26   29
dd          21   21   20   27

In [167]:
#reset_index() - 
df.reset_index()

  index  cc1  cc2  cc3  cc4 newcolumn
0   rr1   21   21   27   20        aa
1   rr2   25   28   26   21        bb
2   rr3   25   20   26   29        cc
3   rr4   21   21   20   27        dd

In [168]:
#drop() - to delete a column

df.drop('newcolumn', axis =1)

     cc1  cc2  cc3  cc4
rr1   21   21   27   20
rr2   25   28   26   21
rr3   25   20   26   29
rr4   21   21   20   27

In [170]:
#column deleted temporarily 
df

     cc1  cc2  cc3  cc4 newcolumn
rr1   21   21   27   20        aa
rr2   25   28   26   21        bb
rr3   25   20   26   29        cc
rr4   21   21   20   27        dd

In [171]:
#drop() - to delete a column permanently
df.drop('newcolumn', inplace =True, axis=1)

In [172]:
df

     cc1  cc2  cc3  cc4
rr1   21   21   27   20
rr2   25   28   26   21
rr3   25   20   26   29
rr4   21   21   20   27

In [179]:
#unique() - It gives all unique values
df['cc1'].unique()

array([21, 25], dtype=int64)

In [180]:
#value_counts() - In cc1 column, each value presented how many times it will give
df['cc1'].value_counts()

21    2
25    2
Name: cc1, dtype: int64

# Handling Missing Values

In [192]:
#create a sample dataset using numpy arrays
df = pd.DataFrame(np.random.rand(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [193]:
df

          W         X         Y         Z
A  0.801048  0.202226  0.252345  0.616920
B  0.583076  0.253743  0.233071  0.087764
C  0.211698  0.552461  0.356725  0.262566
D  0.755354  0.252244  0.854789  0.020075
E  0.264726  0.798225  0.244390  0.635696

In [195]:
df>0.4  #It return True or False

       W      X      Y      Z
A   True  False  False   True
B   True  False  False  False
C  False   True  False  False
D   True  False   True  False
E  False   True  False   True

In [196]:
#creating a new dataframe from an existing dataframe
df1 = df[df>0.4]

In [197]:
df1 #whereever the value is lesser than 0.4 interpreter treats it as NaN value

          W         X         Y         Z
A  0.801048       NaN       NaN  0.616920
B  0.583076       NaN       NaN       NaN
C       NaN  0.552461       NaN       NaN
D  0.755354       NaN  0.854789       NaN
E       NaN  0.798225       NaN  0.635696

In [199]:
#to check whether NaN values
df1.isnull().any
#whereever there are NaN value it displays True else False
#It is a small dataset easily we could observe

<bound method DataFrame.any of        W      X      Y      Z
A  False   True   True  False
B  False   True   True   True
C   True  False   True   True
D  False   True  False   True
E   True  False   True  False>

In [200]:
#for larger datasets
df1.isnull().any()  #It says at column level these columns has null values

W    True
X    True
Y    True
Z    True
dtype: bool

In [202]:
df1.isnull().sum() # it gives total number of null values

W    2
X    3
Y    4
Z    3
dtype: int64

In [204]:
#Method 1 - To handle missing values is drop them
#to drop the null values
df1.dropna() #bydefault axis = 0 and it will delete rowwise

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [206]:
df1.dropna(axis=1) # now it will delete columnwise

Empty DataFrame
Columns: []
Index: [A, B, C, D, E]

In [208]:
df1   #temporary deletion happend in above 2 steps as we have not assigned to a new dataframe

          W         X         Y         Z
A  0.801048       NaN       NaN  0.616920
B  0.583076       NaN       NaN       NaN
C       NaN  0.552461       NaN       NaN
D  0.755354       NaN  0.854789       NaN
E       NaN  0.798225       NaN  0.635696

In [210]:
df1.dropna(thresh = 2) #whereever NaN values are morethan 2 in a row only those rows got deleted

          W         X         Y         Z
A  0.801048       NaN       NaN  0.616920
D  0.755354       NaN  0.854789       NaN
E       NaN  0.798225       NaN  0.635696

In [211]:
df1

          W         X         Y         Z
A  0.801048       NaN       NaN  0.616920
B  0.583076       NaN       NaN       NaN
C       NaN  0.552461       NaN       NaN
D  0.755354       NaN  0.854789       NaN
E       NaN  0.798225       NaN  0.635696

In [213]:
df1.dropna(thresh =2, axis =1) #to delete column wise

          W         X         Z
A  0.801048       NaN  0.616920
B  0.583076       NaN       NaN
C       NaN  0.552461       NaN
D  0.755354       NaN       NaN
E       NaN  0.798225  0.635696

In [214]:
df1

          W         X         Y         Z
A  0.801048       NaN       NaN  0.616920
B  0.583076       NaN       NaN       NaN
C       NaN  0.552461       NaN       NaN
D  0.755354       NaN  0.854789       NaN
E       NaN  0.798225       NaN  0.635696

In [215]:
#Method 2 - Filling the missing values with some data
df1.fillna(value="nothing")

          W         X         Y         Z
A  0.801048   nothing   nothing   0.61692
B  0.583076   nothing   nothing   nothing
C   nothing  0.552461   nothing   nothing
D  0.755354   nothing  0.854789   nothing
E   nothing  0.798225   nothing  0.635696

In [217]:
df1.fillna(value="0")

          W         X         Y         Z
A  0.801048         0         0   0.61692
B  0.583076         0         0         0
C         0  0.552461         0         0
D  0.755354         0  0.854789         0
E         0  0.798225         0  0.635696

In [218]:
df1

          W         X         Y         Z
A  0.801048       NaN       NaN  0.616920
B  0.583076       NaN       NaN       NaN
C       NaN  0.552461       NaN       NaN
D  0.755354       NaN  0.854789       NaN
E       NaN  0.798225       NaN  0.635696

In [222]:
df1.fillna(df['X'].mean())

          W         X         Y         Z
A  0.801048  0.411780  0.411780  0.616920
B  0.583076  0.411780  0.411780  0.411780
C  0.411780  0.552461  0.411780  0.411780
D  0.755354  0.411780  0.854789  0.411780
E  0.411780  0.798225  0.411780  0.635696

In [223]:
df1

          W         X         Y         Z
A  0.801048       NaN       NaN  0.616920
B  0.583076       NaN       NaN       NaN
C       NaN  0.552461       NaN       NaN
D  0.755354       NaN  0.854789       NaN
E       NaN  0.798225       NaN  0.635696

In [224]:
df2 = df1.fillna(df['X'].mean()) #permanent filling with mean value

In [225]:
df2

          W         X         Y         Z
A  0.801048  0.411780  0.411780  0.616920
B  0.583076  0.411780  0.411780  0.411780
C  0.411780  0.552461  0.411780  0.411780
D  0.755354  0.411780  0.854789  0.411780
E  0.411780  0.798225  0.411780  0.635696